In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### what you need to learn
- loading data()
- selection
   - cols
   - rows
- manipulation
    - add col
    - remove col
    - rename col
    - change data type
    - del data
    - remove duplications
    - sort
    - group
    - merge
    - merge
    - pivot
- visualisation
     - line plot
     - bar plot
     - histogram
     - box plot
     - scatter plot
     - heatmap
     - pie chart
     - word cloud

In [4]:
# penguins = sns.load_dataset('penguins')
# penguins

-analysis
  - univariate 
  - bi-variate
  - multivariate

- Loading data
   - custom data
   - excel data
   - csv/json/etc
   - database

In [26]:
student = {'name':['ram','raj','sneha','raju'],
           'college':['msv','kpc','srm','arm'],
           'dob':['12 jan','23feb','3 march','23dec']}
sdf = pd.DataFrame(student)
sdf

    name college      dob
0    ram     msv   12 jan
1    raj     kpc    23feb
2  sneha     srm  3 march
3   raju     arm    23dec

In [10]:
data = pd.read_excel('C:/Users/ASHU/Documents/fruits.xlsx')
data

     item  amount
0   apple     100
1  banana     200
2  mango      150
3  cherry     300

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   item    4 non-null      object
 1   amount  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [15]:
data.columns.tolist()

['item', 'amount']

In [16]:
data['item']

0     apple
1    banana
2    mango
3    cherry
Name: item, dtype: object

In [17]:
data.amount

0    100
1    200
2    150
3    300
Name: amount, dtype: int64

In [19]:
# data[collist]

data[['item','amount']]

     item  amount
0   apple     100
1  banana     200
2  mango      150
3  cherry     300

In [20]:
data['amount'] * data['item']

0    appleappleappleappleappleappleappleappleapplea...
1    bananabananabananabananabananabananabananabana...
2    mango mango mango mango mango mango mango mang...
3    cherrycherrycherrycherrycherrycherrycherrycher...
dtype: object

In [22]:
# data['mew_col'] = expression
data['0new_add'] = data['amount'] * data['item']
data

     item  amount                                           0new_add
0   apple     100  appleappleappleappleappleappleappleappleapplea...
1  banana     200  bananabananabananabananabananabananabananabana...
2  mango      150  mango mango mango mango mango mango mango mang...
3  cherry     300  cherrycherrycherrycherrycherrycherrycherrycher...

In [23]:
data.iloc[0]

item                                                    apple
amount                                                    100
0new_add    appleappleappleappleappleappleappleappleapplea...
Name: 0, dtype: object

In [25]:
student

{'name': ['ram', 'raj', 'sneha', 'raju'],
 'college': ['msv', 'kpc', 'srm', 'arm'],
 'dob': ['12 jan', '23feb', '3 march', '23dec']}

In [27]:
sdf

    name college      dob
0    ram     msv   12 jan
1    raj     kpc    23feb
2  sneha     srm  3 march
3   raju     arm    23dec